package com.vazh2100.num.to.ru.entities

internal object Genitive {

    val ones = arrayOf("", "одно", "двух", "трёх", "четырёх", "пяти", "шести", "семи", "восьми", "девяти")
    val specials = arrayOf(
        "", "одиннадцати", "двенадцати", "тринадцати", "четырнадцати",
        "пятнадцати", "шестнадцати", "семнадцати", "восемнадцати", "девятнадцати"
    )
    val tens = arrayOf(
        "", "десяти", "двадцати", "тридцати", "сорока", "пятидесяти",
        "шестидесяти", "семидесяти", "восьмидесяти", "девяноста"
    )
    const val HUNDRED_GEN = "ста"
}
