package com.vazh2100.num.to.ru.entities

internal object Ordinal {

    val ones = arrayOf(
        "нулевой", "первый", "второй", "третий", "четвёртый",
        "пятый", "шестой", "седьмой", "восьмой", "девятый"
    )
    val specials = arrayOf(
        "", "одиннадцатый", "двенадцатый", "тринадцатый", "четырнадцатый",
        "пятнадцатый", "шестнадцатый", "семнадцатый", "восемнадцатый", "девятнадцатый"
    )
    val tens = arrayOf(
        "", "десятый", "двадцатый", "тридцатый", "сороковой", "пятидесятый",
        "шестидесятый", "семидесятый", "восьмидесятый", "девяностый"
    )
    val hundreds = arrayOf(
        "", "сотый", "двухсотый", "трёхсотый", "четырёхсотый", "пятисотый",
        "шестисотый", "семисотый", "восьмисотый", "девятисотый"
    )
    const val THOUSANDTH = "тысячный"
    const val MILLIONTH = "миллионный"
}
